# -*- coding: utf-8 -*-
from googletrans import Translator
translator = Translator()
translation = translator.translate('చిన్నప్పటి నుంచి గురుకులంలో చదువుకున్న అరవింద్ నాని నిజాయితీ మారుపేరుగా పెరుగుతాడు  అపరిచితుడులో రామం లాగా నిజాయితీగా ఉండే అతను సమాజంలో ఎన్నో ఇబ్బందులు పడాల్సి వస్తుంది చివరికి అరవింద్ నిజాయితీ వల్ల అతడి ప్రాణమే పోయే పరిస్థితి వస్తుంది  ఇలాంటి స్థితిలో తన మిత్రులతో కలిసి అవినీతికి వ్యతిరేకంగా పోరాటం మొదలుపెడతాడు నాని  అవినీతి పరుల జాబితా తీసి వారిపై న్యాయ పోరాటానికి దిగిన అరవింద్కు అతడి పోలికలతో ఉండే మాయా కన్నన్ నుంచి పెద్ద సమస్య ఎదురవుతుంది  ఇలాంటి స్థితిలో అతనేం చేశాడు తన పోరాటంలో అతను గెలిచాడా లేదా అన్నది మిగతా కథ కథనం. అవినీతిపై పోరాటం నేపథ్యంలో గతంలో చాలా సినిమాలు వచ్చాయి  జెండాపై కపిరాజుకు కొన్ని సినిమాలతో పోలికలున్నప్పటికీ తమిళ దర్శకుడు సముద్రఖని సమస్యను కొంచెం భిన్నంగా డీల్ చేసే ప్రయత్నం చేశాడు సినిమాకు ప్రధానమైన హైలైట్ కాన్సెప్టే  ఐతే కాన్సెప్ట్ మీద నాని మీద ఎక్కువ డిపెండ్ అయిన సముద్రఖని సినిమాను అనుకున్నంత ఆసక్తికరంగా తీర్చిదిద్దలేకపోయాడు  కొన్ని ఎపిసోడ్ల్లో చాలా బాగా అనిపించే జెండాపై కపిరాజు కొన్ని చోట్ల చాలా బోర్ కొట్టించేసి చివరికి ఏవరేజ్ ప్రయత్నంలా మిగిలిపోయింది సమస్యలోకి వెళ్లడానికి దర్శకుడు ఎక్కువ సమయం తీసుకోవడమే పెద్ద సమస్య  నిజాయితీ పరుడైన హీరో సొసైటీలో ఇమడలేక ఇబ్బంది పడే సన్నివేశాలు చాలా రొటీన్గా ఉన్నాయి  ఇవన్నీ చాలా సినిమాల్లో చూసినవే కాబట్టి వీటి మీద అంత ఫోకస్ పెట్టాల్సింది కాదు ఒకట్రెండు బలమైన సన్నివేశాలతో తేల్చేయాల్సింది  పావుగంటలో చెప్పాల్సిన విషయం కోసం ముప్పావుగంట తీసుకున్నాడు సముద్రఖని  దీనికి తోడు హీరో హీరోయిన్ల ప్రేమకథ కూడా పంటికింద రాయిలా ఇబ్బంది పెడుతుంది   ఇంటర్వెల్కు ముందు వచ్చే 20 నిమిషాల ఎపిసోడ్ సినిమాకు ఒక్కసారిగా ఊపు తెచ్చి ద్వితీయార్ధంపై ప్రేక్షకులకు ఆసక్తి రేపుతుంది  సెకండాఫ్లో మాయా కన్నన్ పాత్ర ప్రవేశంతో మరింత ఊపు వస్తుంది కానీ ఆ పాత్ర ప్రవేశించాక రసవత్తరంగా సాగాల్సిన కథనం పడిలేస్తూ సాగుతుంది ')
with open('pos_review.txt') as f:
    linespos = f.read().strip().split('_')

# print(lines)
l = []
for line in linespos:
    if line:
        l.append((line.decode('utf-8'), 'pos'))

with open('neg_review.txt') as f:
    linesneg = f.read().strip().split('_')

for line in linesneg:
    if line:
        l.append((line.decode('utf-8'), 'neg'))

print(translation)
